class ArithmeticConversion:
    """
    Класс для задачи №3.
    """
    the_task = (f"Входные данные: три массива с числами. "
                f"Требуется проверить можно ли получить число из 3-го массива, "
                f"арифметическими преобразованиями с числами из двух других массивов. "
                f"Числа проверяются последовательно.")

    def __init__(self):
        pass

    def ui_for_task(self):
        """
        Функция реализующая пользовательский интерфейс в консоли для задачи.
        """
        pass

    def task_algorithm(self):
        """
        Функция реализующая алгоритм задачи
        """
        pass

    def check_arithmetic_operation(self):
        """
        Функция реализующая проверку: можно ли получить число из 3-го массива, заданным арифметическим преобразованием
        с числами 2-ух других массивов. В случае положительного результата добавляет полученый способ в список результатов.
        """
        pass
