class DistanceBetweenPoints:
    """
    Класс для задачи №2.
    """
    the_task = (f"Входные данные: два массива с точками и число. "
                f"Требуется вывести точки из первого и второго массивов, "
                f"расстояния между которыми больше заданного числа. "
                f"Расстояния считаются только для соответствующих чисел.")

    def __init__(self):
        pass

    def ui_for_task(self):
        """
        Функция реализующая пользовательский интерфейс в консоли для задачи.
        """
        pass

    def task_algorithm(self):
        """
        Функция поиска точек расстояние между которыми больше заданного.
        """
        pass

    def segment_length(self):
        """
        Функция вычисляющая длину отрезка образованного двумя точками.
        """
        pass
