class NumberOfCommonNumbers:
    """
    Класс для задачи №1.
    """
    the_task = (f"Входные данные: два массива с числами. Требуется проверить сколько у массивов общих чисел. "
                f"Также число будет считаться общим если оно входит в один массив, а в другом массиве находится "
                f"его перевернутая версия.")

    @staticmethod
    def ui_for_task():
        """
        Функция реализующая пользовательский интерфейс в консоли для задачи.
        """
        pass

    @staticmethod
    def task_algorithm():
        """
        Алгоритм решения задачи.
        """
        pass
