class NumberOfCommonNumbers:
    """
    Класс для задачи №1.
    """
    the_task = (f"Входные данные: два массива с числами. Требуется проверить сколько у массивов общих чисел. "
                f"Также число будет считаться общим если оно входит в один массив, а в другом массиве находится "
                f"его перевернутая версия.")

    def __init__(self):
        pass

    def ui_for_task(self):
        """
        Функция реализующая пользовательский интерфейс в консоли для задачи.
        """
        pass

    def task_algorithm(self):
        """
        Алгоритм решения задачи.
        """
        pass
